000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. CALCULATRICE.
000300 
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 01 NUM1 PIC 9(5).
000700 01 NUM2 PIC 9(5).
000800 01 RESULTAT PIC 9(6).
000900 
001000 PROCEDURE DIVISION.
001100     DISPLAY "Entrez le premier nombre: ".
001200     ACCEPT NUM1.
001300     DISPLAY "Entrez le deuxième nombre: ".
001400     ACCEPT NUM2.
001500     
001600     COMPUTE RESULTAT = NUM1 + NUM2.
001700     DISPLAY "Résultat: " RESULTAT.
001800     
001900     STOP RUN.
