000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. CALCULATRICE.
000300 
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 01 NUM1 PIC 9(5).
000700 01 NUM2 PIC 9(5).
000800 01 RESULTAT PIC 9(6). 
000900 PROCEDURE DIVISION.
001000     DISPLAY "Entrez le premier nombre: ".
001100     ACCEPT NUM1.
001200     DISPLAY "Entrez le deuxième nombre: ".
001300     ACCEPT NUM2.
001600     
001700     COMPUTE RESULTAT = NUM1 + NUM2.
001800     DISPLAY "Résultat: " RESULTAT.
001900     
002000     STOP RUN.
